In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan,'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna() #等价于data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
   ....:                      [NA, NA, NA], [NA, 6.5, 3.]])

In [11]:
 cleaned = data.dropna()

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = NA

In [16]:
 data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.randn(7, 3))

In [19]:
df.iloc[:4, 1] = NA

In [20]:
df.iloc[:2, 2] = NA

In [21]:
df

          0         1         2
0 -1.520815       NaN       NaN
1 -1.487060       NaN       NaN
2  0.314922       NaN  1.237522
3 -0.807662       NaN  0.803724
4  2.697778 -0.119428 -0.183423
5 -2.146103  1.826320 -0.679582
6 -0.026910  0.308600  0.968098

In [22]:
 df.dropna()

          0         1         2
4  2.697778 -0.119428 -0.183423
5 -2.146103  1.826320 -0.679582
6 -0.026910  0.308600  0.968098

In [23]:
 df.dropna(thresh=2)

          0         1         2
2  0.314922       NaN  1.237522
3 -0.807662       NaN  0.803724
4  2.697778 -0.119428 -0.183423
5 -2.146103  1.826320 -0.679582
6 -0.026910  0.308600  0.968098

In [24]:
 df.fillna(0)

          0         1         2
0 -1.520815  0.000000  0.000000
1 -1.487060  0.000000  0.000000
2  0.314922  0.000000  1.237522
3 -0.807662  0.000000  0.803724
4  2.697778 -0.119428 -0.183423
5 -2.146103  1.826320 -0.679582
6 -0.026910  0.308600  0.968098

In [25]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.520815  0.500000  0.000000
1 -1.487060  0.500000  0.000000
2  0.314922  0.500000  1.237522
3 -0.807662  0.500000  0.803724
4  2.697778 -0.119428 -0.183423
5 -2.146103  1.826320 -0.679582
6 -0.026910  0.308600  0.968098

In [26]:
 _ = df.fillna(0, inplace=True)

In [27]:
 df

          0         1         2
0 -1.520815  0.000000  0.000000
1 -1.487060  0.000000  0.000000
2  0.314922  0.000000  1.237522
3 -0.807662  0.000000  0.803724
4  2.697778 -0.119428 -0.183423
5 -2.146103  1.826320 -0.679582
6 -0.026910  0.308600  0.968098

In [28]:
df = pd.DataFrame(np.random.randn(6, 3))

In [29]:
df.iloc[2:, 1] = NA

In [30]:
df.iloc[4:, 2] = NA

In [31]:
df

          0         1         2
0 -0.955503 -0.383982 -0.720627
1 -0.594296  0.241801  1.763415
2 -0.220386       NaN -1.085175
3 -0.112682       NaN -1.206832
4 -0.827092       NaN       NaN
5 -0.738698       NaN       NaN

In [32]:
df.fillna(method='ffill')

          0         1         2
0 -0.955503 -0.383982 -0.720627
1 -0.594296  0.241801  1.763415
2 -0.220386  0.241801 -1.085175
3 -0.112682  0.241801 -1.206832
4 -0.827092  0.241801 -1.206832
5 -0.738698  0.241801 -1.206832

In [33]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.955503 -0.383982 -0.720627
1 -0.594296  0.241801  1.763415
2 -0.220386  0.241801 -1.085175
3 -0.112682  0.241801 -1.206832
4 -0.827092       NaN -1.206832
5 -0.738698       NaN -1.206832

In [34]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [35]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [36]:
 data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
   ....:                      'k2': [1, 1, 2, 3, 3, 4, 4]})

In [37]:
 data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [38]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [39]:
data.drop_duplicates()  #会判断全部的列

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [40]:
data['v1'] = range(7)

In [41]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [42]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [43]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
         'Pastrami', 'corned beef', 'Bacon',
         'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [44]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [45]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [46]:
lowercased = data['food'].str.lower()

In [47]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [48]:
 data['animal'] = lowercased.map(meat_to_animal)

In [49]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [50]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [51]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [52]:
 data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [53]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [54]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [55]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [56]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [57]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
   ....:                     index=['Ohio', 'Colorado', 'New York'],
   ....:                     columns=['one', 'two', 'three', 'four'])

In [58]:
transform = lambda x: x[:4].upper()

In [59]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [60]:
data.index = data.index.map(transform)

In [61]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [62]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [63]:
data.rename(index={'OHIO': 'INDIANA'},
   ....:             columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [64]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [65]:
 data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [66]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [67]:
 bins = [18, 25, 35, 60, 100]

In [68]:
cats = pd.cut(ages, bins)

In [69]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [70]:
cats.codes #年龄数据的标签 第一个分组(18-25)为0 第二个为1

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [71]:
 cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [72]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [73]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [74]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged',
'Senior']

In [75]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [76]:
data = np.random.rand(20)

In [77]:
pd.cut(data, 4, precision=2)

[(0.069, 0.28], (0.069, 0.28], (0.28, 0.48], (0.28, 0.48], (0.28, 0.48], ..., (0.48, 0.69], (0.28, 0.48], (0.48, 0.69], (0.28, 0.48], (0.48, 0.69]]
Length: 20
Categories (4, interval[float64]): [(0.069, 0.28] < (0.28, 0.48] < (0.48, 0.69] < (0.69, 0.9]]

In [78]:
data = np.random.randn(1000)

In [79]:
cats = pd.qcut(data, 4)
#qcut 是一个非常类似于 cut 的函数，它可以根据样本分位数对数据进行面元划 分。
#根据数据的分布情况，cut 可能无法使各个面元中含有相同数量的数据 点。
#而 qcut 由于使用的是样本分位数，因此可以得到大小基本相等的面元

In [80]:
cats

[(0.731, 3.356], (0.0582, 0.731], (0.731, 3.356], (-0.555, 0.0582], (-2.7849999999999997, -0.555], ..., (-2.7849999999999997, -0.555], (-0.555, 0.0582], (-0.555, 0.0582], (0.731, 3.356], (-2.7849999999999997, -0.555]]
Length: 1000
Categories (4, interval[float64]): [(-2.7849999999999997, -0.555] < (-0.555, 0.0582] < (0.0582, 0.731] < (0.731, 3.356]]

In [81]:
pd.value_counts(cats)

(0.731, 3.356]                   250
(0.0582, 0.731]                  250
(-0.555, 0.0582]                 250
(-2.7849999999999997, -0.555]    250
dtype: int64

In [82]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.0582, 1.24], (0.0582, 1.24], (1.24, 3.356], (-1.18, 0.0582], (-1.18, 0.0582], ..., (-1.18, 0.0582], (-1.18, 0.0582], (-1.18, 0.0582], (0.0582, 1.24], (-1.18, 0.0582]]
Length: 1000
Categories (4, interval[float64]): [(-2.7849999999999997, -1.18] < (-1.18, 0.0582] < (0.0582, 1.24] < (1.24, 3.356]]

In [83]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [84]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.024071    -0.017549    -0.014403     0.013664
std       1.004456     1.046984     0.989534     0.979554
min      -3.057519    -3.257056    -3.046097    -2.963513
25%      -0.699711    -0.756670    -0.728724    -0.656120
50%      -0.031926     0.000820    -0.026148     0.040810
75%       0.658626     0.687930     0.678465     0.655516
max       3.353443     3.240739     3.367550     3.038364

In [85]:
col = data[2]

In [86]:
col[np.abs(col) > 3]

298    3.367550
626    3.021538
948   -3.046097
Name: 2, dtype: float64

In [87]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
95  -0.234638  3.126168 -0.879959 -0.544140
219 -0.469562  0.840777 -2.910288  3.021577
262  3.353443  0.765026  0.822139 -0.843167
298  0.717972  0.565184  3.367550  0.602708
380  1.350394 -3.094538 -0.993096  0.458540
551 -0.822910  0.776755  1.059602  3.038364
626  0.137590  0.403442  3.021538  0.151703
765 -0.777101  3.240739 -0.593026  0.780628
896 -3.057519  0.990780  0.695381  0.232300
948 -1.698917  1.764043 -3.046097 -0.323792
983  0.794553 -3.080479 -1.005734 -0.502424
991 -0.603962 -3.257056  2.345735 -1.217430

In [88]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [89]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.024367    -0.017484    -0.014746     0.013604
std       1.003155     1.044617     0.988138     0.979370
min      -3.000000    -3.000000    -3.000000    -2.963513
25%      -0.699711    -0.756670    -0.728724    -0.656120
50%      -0.031926     0.000820    -0.026148     0.040810
75%       0.658626     0.687930     0.678465     0.655516
max       3.000000     3.000000     3.000000     3.000000

In [90]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0 -1.0 -1.0 -1.0
2 -1.0  1.0 -1.0  1.0
3  1.0 -1.0  1.0  1.0
4 -1.0 -1.0  1.0  1.0

In [91]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [92]:
sampler = np.random.permutation(5)

In [93]:
sampler

array([2, 3, 0, 1, 4])

In [94]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [95]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
0   0   1   2   3
1   4   5   6   7
4  16  17  18  19

In [96]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [97]:
choices = pd.Series([5, 7, -1, 6, 4])

In [98]:
 draws = choices.sample(n=10, replace=True)

In [99]:
 draws

3    6
1    7
4    4
1    7
1    7
1    7
1    7
4    4
0    5
2   -1
dtype: int64

In [100]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
   .....:                    'data1': range(6)})

In [101]:
 pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [102]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [103]:
df_with_dummy = df[['data1']].join(dummies)

In [104]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [105]:
mnames = ['movie_id', 'title', 'genres']

In [107]:
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                            header=None, names=mnames)

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [108]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [109]:
all_genres = []

In [111]:
for x in movies.genres:
       .....:     all_genres.extend(x.split('|'))

In [112]:
 genres = pd.unique(all_genres)

In [113]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [114]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [115]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [116]:
gen = movies.genres[0]

In [117]:
gen.split('|') #'第一个参数‘|’作为分列的依据.第二个参数就是前面用到的expand=True为dataframe。false为series。第三个参数n为分成多少份

['Animation', "Children's", 'Comedy']

In [118]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [119]:
 for i, gen in enumerate(movies.genres):
   .....:     indices = dummies.columns.get_indexer(gen.split('|'))
   .....:     dummies.iloc[i, indices] = 1

In [120]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [121]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [122]:
 np.random.seed(12345)

In [124]:
values = np.random.rand(10)

In [125]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [126]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [127]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [128]:
val = 'a,b,  guido'

In [129]:
val.split(',')

['a', 'b', '  guido']

In [130]:
pieces = [x.strip() for x in val.split(',')]
#split 常常与 strip 一起使用，以去除空白符(包括换行符)

In [131]:
pieces

['a', 'b', 'guido']

In [132]:
first, second, third = pieces

In [133]:
first + '::' + second + '::' + third

'a::b::guido'

In [134]:
'::'.join(pieces)

'a::b::guido'

In [135]:
'guido' in val

True

In [142]:
val.index(',')

1

In [140]:
val.find('45')
#注意 find 和 index 的区别:如果找不到字符串，index 将会引发一个异常(而 不是返回-1):

-1

In [143]:
val.index(':')

ValueError: substring not found

In [144]:
val.count(',')

2

In [145]:
val.replace(',', '::')

'a::b::  guido'

In [146]:
val.replace(',', '')

'ab  guido'

In [147]:
#正则表达式提供了一种灵活的在文本中搜索或匹配(通常比前者复杂)字符串 模式的方式。
#正则表达式，常称作 regex，是根据正则表达式语言编写的字符 串。
import re

In [148]:
text = "foo    bar\t baz  \tqux"

In [149]:
re.split('\s+', text)
#描述一个或多个空白 符的 regex 是\s+:

['foo', 'bar', 'baz', 'qux']

In [150]:
regex = re.compile('\s+')

In [151]:
 regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [152]:
regex.findall(text)

['    ', '\t ', '  \t']

In [160]:

text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [161]:
regex = re.compile(pattern, flags=re.IGNORECASE)
#可以用 re.compile 自己编译 regex 以得到一个可重用的 regex 对象:

In [162]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [163]:
m = regex.search(text)

In [164]:
m

In [165]:
text[m.start():m.end()]

'dave@google.com'

In [166]:
print(regex.match(text))

None

In [167]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [168]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [169]:
 regex = re.compile(pattern, flags=re.IGNORECASE)

In [175]:
m = regex.match('wesm@bright.net')

In [171]:
m.groups()

('wesm', 'bright', 'net')

In [172]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [176]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [178]:
data = {'Dave': 'dave@google.com', 'Steve':'steve@gmail.com',
   .....:         'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [179]:
data = pd.Series(data)

In [180]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [181]:
 data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [182]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [183]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [184]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [185]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [186]:
 matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [187]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [188]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object